Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartBadConnectionSizeWarning
The connection invalid due to connectors sizes are not the same.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartBadConnectionConnectivityWarning
The connection invalid due to connection types associated to the connectors are not compatible.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartBadConnectionAlignmentWarning
The connection invalid due to the connector are not aligned and/or this is a gap between the connectors.